Repository: alislaiman496/Ecomerce_flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Ecommerce
ar: متجر الكتروني

source: Email is required
ar: يرجى ادخال عنوان البريد الالكتروني

source: Enter valid Email
ar: الصيغة غير صحيحة

source: Please enter password
ar: يرجى ادخال كلمة السر

source: Enter a hard password
ar: كلمة السر ضعيفة

source: Phone number is required
ar: يرجى ادخال رقم الهاتف

source: Enter valid Phone number
ar: صيغة الرقم غير صحيحة

source: First Name
ar: الاسم

source: Enter your first name
ar: الاسم

source: First Name Should not be Empty
ar: يرجى ادخال الاسم

source: Last Name Should not be Empty
ar: يرجى ادخال الكنية

source: Last Name
ar: الكنية

source: Enter your last name
ar: ادخل الكنية

source: E-mail address
ar: البريد الالكتروني

source: Enter your email
ar: ادخل البريد الالكترني

source: Mobile Number
ar: رقم الجوال

source: Enter your mobile number
ar: ادخل رقم الجوال

source: Password*
ar: كلمة السر*

source: Enter your password
ar: ادخل كلمة السر الخاصة بك

source: Confirm Password*
ar: تاكبد كلمة السر

source: Confirm your password
ar: تاكبد كلمة السر الخاصة بك

source: Please Re-Enter your password
ar: اعد ادخال كلمة السر الخاصة بك

source: Please Re-Enter the same password
ar: ادخل كلمة السر الخاصة بك مرة ثانية

source: I accept all terms and conditions.
ar: اوافق على جميع الشروط

source: You need to accept terms and conditions
ar: عليك ان توافق على جميع الشروط

source: Register
ar: تسجيل الحساب

source: This account is Logged in
ar: هذا الحساب مسجل مسبقا

source: Or create account using social media
ar: او انشاء الحساب عن طريق وسائل التواصل الاخرى

source: Wrong Email please Enter a valid Email
ar: عنوان البريد الالكتروني غير صحيح

source: Hello
ar: مرحبا

source: Signing into your account
ar: تسجيل الدخول عن طريق حسابك

source: Forget your password?
ar: هل نسيت كلمة السر؟

source: Sign In
ar: تسجيل الدخول

source: Wrong Email You are not Logged in
ar: هذالحساب غير مسحل مسبق

source: Wrong Password
ar: كلمة السر خاطئة

source: Don\'t have an account?
ar: لا تملك حساب؟

source: Create
ar: انشاء حساب

source: Profile Page
ar: الصفحة الشخصية

source: Login Page
ar: الانتقال الى صفحة تسجيل الدخول

source: Registration Page
ar: الانتقال الى صفحة تسجيل الحساب

source: Forget Password Page
ar: الانتقال الى صفحة ادخال كلمة مرور جديدة

source: Verification Page
ar: الانتقال الى صفحة التاكد من عنوان البريد الالكتروني

source: LogOut Page
ar: تسجبل الخروج

source: Mr.
ar: السيد.

source: Engineering
ar: مهندس

source: User Information
ar: معلومات المستخدم

source: Location
ar: الموقع

source: Syria
ar: سوريا

source: About Me
ar: عن المستخدم

# thisIsAboutMeLink
source: This is a about me link and you can know about me in this section.
ar: هذا الرابط عني ويمكنك أن تعرف عني في هذا الجزء.

source: Jewelery
ar: المجوهرات

source: Electronics
ar: الالكترونيات

source: Men\'s Clothing
ar: ثياب شبابية

source: Women\'s Clothing
ar: ثياب بناتية

source: Product Page
ar: المنتجات

# thisCodeWillBeExpiredIn
source: This code will expired in
ar: ستنتهي صلاحية هذا الرمز خلال

source: We sent your code to
ar: لقد ارسلنا رمز التفعيل الى

source: Please Enter the PinCode
ar: يرجى ادخال رمز التفعيل

source: Confirm
ar: تاكيد

source: Pin is incorrect
ar: رمز التفعيل غير صحيح

source: Oops...
ar: أُووبس...

# sorryThePinCodeExpired
source: Sorry, The PinCode expired, Press ok to resend PinCode
ar: "عذرًا ، انتهت صلاحية رمز التفعيل ، اضغط على" موافق "لإعادة إرسال رمز التفعيل

source: ResendPinCode
ar: اعادة ارسال رمز التفعيل

# insertNewPassword
source: Insert a New Password
ar: ادخل كلمة سر جديدة

source: NewPassword*
ar: كلمة السر الجديدة*

source: Enter your NewPassword
ar: ادخل كلمة السر الجديدة الخاصة بك

source: Verification Your Email Address
ar: التاكد من عنوان البريد الالكتروني

source: Welcome to the E-commerce app
ar: مرحبًا بك في تطبيق متجر الالكتروني

source: Signing or Registering into an account
ar: تسجيل الحساب او تسحيل الدخول

source: Sign up
ar: تسجيل الحساب
